#### Terraform Workspace - `sandbox`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
workspaces/sandbox relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/infrastructura/infrastructura/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/infrastructura/infrastructura

To view this run in a browser, visit:
https://app.terraform.io/app/aetherisnova/sandbox/runs/run-WVXPPk4M7sKg6jL3

Waiting for the plan to start...

Terraform v1.10.4
on linux_amd64
Initializing plugins and modules...
data.digitalocean_domain.domain: Refreshing...
module.codex_aetherium_app.data.doppler_secrets.codex_aetherium: Refreshing...
module.portae_astrales_app.data.doppler_secrets.portae_astrales: Refreshing...
module.codex_aetherium_app.data.doppler_secrets.codex_aetherium: Refresh complete after 1s [id=263bbca356bbd49be08f40cd8494aaab0238afe4488d9844d26d80ee8723be62]
module.portae_astrales_app.data.doppler_secrets.portae_astrales: Refresh complete after 1s [id=d21a14834e972a1758bbce1f45e1752ba5fe5bf9a83aade6c0bdd71f1acbffa2]
data.digitalocean_domain.domain: Refresh complete after 2s [id=aetherisnova.org]
module.portae_astrales_app.digitalocean_app.app: Refreshing state... [id=178fd1d2-6ed2-47b6-a0bb-c553e2730e91]
digitalocean_record.portae_astrales_app_domain: Refreshing state... [id=1766476791]
digitalocean_project.project: Refreshing state... [id=5bfb4ddb-e5ff-4502-9b82-8a5c2724cac2]
module.portae_astrales_app.digitalocean_app.app: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_record.codex_aetherium_app_domain will be created
  + resource "digitalocean_record" "codex_aetherium_app_domain" {
      + domain = "aetherisnova.org"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "codexaetherium.sandbox"
      + ttl    = (known after apply)
      + type   = "CNAME"
      + value  = (known after apply)
    }

  # module.codex_aetherium_app.digitalocean_app.app will be created
  + resource "digitalocean_app" "app" {
      + active_deployment_id = (known after apply)
      + created_at           = (known after apply)
      + default_ingress      = (known after apply)
      + id                   = (known after apply)
      + live_domain          = (known after apply)
      + live_url             = (known after apply)
      + project_id           = (known after apply)
      + updated_at           = (known after apply)
      + urn                  = (known after apply)

      + dedicated_ips (known after apply)

      + spec {
          + domains  = (known after apply)
          + features = (known after apply)
          + name     = "sandbox--codex-aetherium-app"
          + region   = "ams"

          + domain {
              + name     = "codexaetherium.sandbox.aetherisnova.org"
              + type     = "PRIMARY"
              + wildcard = (known after apply)
            }

          + ingress (known after apply)

          + static_site {
              + build_command     = "pnpm -F @aetherisnova/codex-aetherium build"
              + catchall_document = "index.html"
              + name              = "codex-aetherium-app"
              + output_dir        = "/packages/codex-aetherium/dist"

              + github {
                  + branch         = "beta"
                  + deploy_on_push = true
                  + repo           = "aetheris-nova/regimen-contractus"
                }

              + routes (known after apply)
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kieranroneill, Action: `pull_request`, Working Directory: ``, Workflow: `Sandbox`*